import japanese.シイムラウドセップ;

public class Main {
	public static void main(String[] args)
	{
		シイムラウドセップ shiimu = new シイムラウドセップ("Ş̝̟͎̫̱̈́̎ͤ̽́͌́̓͆͐ͨ͒͊ͮͪ̀͞ͅi̴͇̪̝͕͖̪ͩ̄̆̂͂̇͌̃̈́͡͞ȋ̸̤̙͋ͤ̑̑͞ͅm̷̸̢̺̰̼̙̱̲͈̬̪̹͉͎̹ͥ͐̐͑̇̐̾ͨ̾̃͒ͪͫ͆͟͞ͅ ̼͙͍͖̪̖͕̫̭̂̈̉̈͌̚͟R̴̵̤̖̺͈͍̫̜̯̱̰̹͚̟̝̖͔͖̂̽ͪ̈̈̒̒̂͝ͅͅa̸̵͍̰͎̘̯̟͕̼̳̫̦̪ͨ̿͋ͬ̓̐̇ͭ̚̚u̴̢̮̱̟̠͖͇̳̞͓̱͉̜͓̼̪͇̹ͫ͗̋͊̒̈́ͫ́̾̊ḑ̷͎̠̦̖͆̽̔ͦ̂̓̅̇̎ͯͪ͒ͯ̓́́͟s̵̡̨̳̟̮̊͂̔ͥͣͬ͂̎ͪͭ͗ͅẽ̱̯̣̖͈͆̀ͥ̓̈͂̈͘͟͢p̊̅͗ͪ̊̋̎̉̓̉͛̄̍ͦͮ́̆͋̍҉̢̛̣̲̱͕͍̣̤͖ͅp̷͕̞͙͕͎̓̿̓̇͂̑̓͊̐̍̊ͭ̈͊̃̾͌̚̕͡", 23, "B̸̫̙͔̹̥̫̯̟̦̮̝̩̞̠ͤ̉̍͑̀ͭͫ͘͞ͅr̛͎̖͓̪͍̱̪͖͖̯̍ͤͣ͋ͪͫͬ͋ͧ̐͐ͣ̽̆̋̊̀̽̓́͡͡ǒ̟̜̪̩̤͖͖͎̼͖͙̥͓̙ͤ̑̽́́͜͜g̷͖̦̮̞̳̪͙̼͔̪͌̑̓̄̄̉̔͒̈́ͮ̔ͨͨ͘ṟ̵̶̡̛̗̭͉̙͓̘̥͈̟̯͓̝̖̓ͥ̾̒̿͒͒͋̾̒̍̉̚͟ͅa̷̸ͦ̾̽ͪ͆ͨ̄͆͝͏̬̜͈̰͚́m̷̢̝͍͈͓̺̏̌̿̓ͥ̉̽̿̎͜͟͡m̴̡̱̘̭̝̹͔̬̥̠̯͛ͧͥ̀͢ȩ̶͔͚̳̜̙͇̜̺̣̪̙̝̻̟̲̒̏̀̈́̓͒̈́͐̑ͦͭ̾̀̚͢͜ͅȑ̄̐̆ͫ̒̃̄̔ͤͮ̊̏ͯͩ͆̑͟͝҉͉̬̟̫͕̥̮͞ͅͅ");
//		shiimu.mõtle();
	}
}
